# Домашнее задание:
# I)
# Напишите программу, которая определяет наибольшее и наименьшее из двух чисел, введенных пользователем.
# II)
# Напишите программу, которая проверяет является ли введенное пользователем число четным.
# III)
# Напишите программу, которая, получает на вход 2 числа (большее и меньшее). Определить, кратно ли первое число второму. Вывести на экран сообщение об этом, а также остаток от деления, если первое число не кратно второму.
#
# x = int(input("number 1: "))
# y = int(input("number 2: "))
# print(x,y)
# if x > y :
#     print("x больше y")
# else:
#     print("x меньше y")
# x = int(input("number : "))
# if x % 2 == 0:
#     print("четное")
# else:
#     print("нечетное")
#
# x = int(input("number 1: "))
# y = int(input("number 2: "))
# z = x % y
# if z == 0:
#     print("x кратно y")
# else:
#     print("x не кратно y")
# print("остаток",z)

